#include "Header.h"
#include "Recursion.h"
using namespace std;
int FirstTermMenu();
void clear1();
void lab1();
void lab2_1();
void lab2_2();
void lab3_1();
void lab3_2();
void lab4();

int FirstTermMenu() {
	SetColor(0, CL_WHITE);
	char i = 0; // Исправлен тип переменной на char
	setlocale(LC_ALL, "Russian");
	CLS;
	do {
		SetColor(0, CL_YELLOW);
		cout << "Выберите лабораторную работу:" << endl;
		cout << "1) Задание 1. Простые вычисления по формулам" << endl;
		cout << "2) Задание 2.1. Вычисления с выбором формул" << endl;
		cout << "3) Задание 2.2 Анализ данных и принятие решения" << endl;
		SetColor(0, CL_BLUE);
		cout << "4) Задание 3.1. Обработка одномерных массивов (типовая)" << endl;
		cout << "5) Задание 3.2. Обработка одномерных массивов с ветвлением алгоритма" << endl;
		cout << "6) Задание 4 Обработка матриц" << endl;
		cout << "0) Выход из программы" << endl;
		SetColor(0, CL_WHITE);

		i = _getch(); // Получение символа нажатой клавиши
		system("cls"); // Очистка экрана

		switch (i) {
		case '1':
			lab1();
			break;
		case '2':
			lab2_1();
			break;
		case '3':
			lab2_2();
			break;
		case '4':
			lab3_1();
			break;
		case '5':
			lab3_2();
			break;
		case '6':
			lab4();
			break;
		case '0':
			return 0;
		default:
			cout << "\n\nНажмите любую клавишу для продолжения..";
			_getch(); // Добавлен вызов функции для ожидания нажатия клавиши
		}
	} while (i != ESC);
	CLS; // Добавлено возвращение значения в конце функции
}

void lab1() {

	cout << "Автор:\tАмин Борлаков. \nТема: Вычисление 2-ух переменных\n\n" << endl;
	cout << "Задание: Вычислить сумму 2 значений" << endl;
	int a, b;
	cout << "Введите значения A и B для их суммы через пробел: " << endl;
	cin >> a >> b;
	CLS;
	cout << "Сумма значений равна: " << a + b << endl;
	cout << "\n\nНажмите любую клавишу для продолжения..";
	_getch();
	CLS;
}

void lab2_1()
{
	{
		cout << "Автор: Амин Борлаков. \nТема: Алгоритмы с ветвлением: ветвление с выбором формул" << endl;
		cout << "\n\n\nДаны переменные d,f,g,h. Определить:\n C = min{d,f,g,h}+max{d,f,g,h};\n D = |d*f|-h, если C < 0.7;\n D = sqrt(2*C)+d, если 0.7 <= C < 1;\n D = g*g, если 1 <= C < 5;\n D = hsqrt(C), если C>=5.\n";
		int d, f, g, h, min, max, C, D, x1, x2, x3;
		x1 = 7 / 10;
		x2 = 1;
		x3 = 5;

			// Пользователь вводит значения переменных d, f, g, h
			cout << "\n\n\nВведите целочисленное значение d = ";
		cin >> d;
		cout << "Введите целочисленное значение f = ";
		cin >> f;
		cout << "Введите целочисленное значение g = ";
		cin >> g;
		cout << "Введите целочисленное значение h = ";
		cin >> h;
		CLS;
		// Находим минимальное и максимальное значения из d, f, g, h
		min = max = d;
		if (min > f)
			min = f;
		if (min > g)
			min = g;
		if (min > h)
			min = h;
		cout << "\nИсходные значения: \nD = " << d << endl;
		cout << "F = " << f << endl;
		cout << "G = " << g << endl;
		cout << "H = " << h << endl;
		cout << "\nМинимум = " << min << endl;

		if (max < f)
			max = f;
		if (max < g)
			max = g;
		if (max < h)
			max = h;
		cout << "Максимум = " << max << endl;

		// Вычисляем C и D в зависимости от значения C
		C = min + max;
		if (C < x1) {
			D = abs(d * f) - h;
		}
		else if (x1 <= C && C < x2) {
			D = sqrt(2 * C) + d;
		}
		else if (x2 <= C && C < x3) {
			D = g * g;
		}
		else if (C >= x3) {
			D = h * sqrt(C);
		}

		// Выводим результаты
		cout << "\nC = " << C << endl;
		cout << "D = " << D << endl;

		// Завершение программы
		cout << "\n\nНажмите любую клавишу для продолжения...";
		_getch();
		CLS;
	}
}

void lab2_2()
{
	int W, V, H;
	cout << "\t\t\tАвтор: Амин Борлаков. \nТема: Анализ данных и принятие решения" << endl;
	cout << "\n\nДаны переменные W,V,H. Определить, какая из переменных является квадратом суммы двух других.\nПри отсутствии такой переменной выводится соответствующее сообщение.\n";
	double  check = 1, k = 1;
	while (check) {
		cout << "\n\n\tТест номер " << k << endl;
		cout << "\nВведите значение W= ";
		cin >> W;
		cout << "Введите значение V= ";
		cin >> V;
		cout << "Введите значение H= ";
		cin >> H;
		cout << "\nНомер теста " << k << "\n";
		CLS;
		if (W != 0 && V != 0 && H != 0 && (W > 0 || V > 0 || H > 0))
		{
			cout << "Принято решение: " << endl;
			if ((W + V) * (W + V) == H)
			{
				cout << "H = " << H << " является суммой квадратов переменных " << "W = " << W << " и " << "V = " << V;
			}
			else if ((W + H) * (W + H) == V)
			{
				cout << "V = " << V << " является суммой квадратов переменных " << "W = " << W << " и " << "H = " << H;
			}
			else if ((V + H) * (V + H) == W)
			{
				cout << "W = " << W << " является суммой квадратов переменных " << "V = " << V << " и " << "H = " << H;

			}
			else
			{
				cout << "Ни одна из переменных не является суммой двух других";
			}
		}
		else
		{
			cout << "Решение не принято, так как данные некорректные";
			cout << "\n\nОшибка! Все три значения должны быть положительными\n";
		}
		cout << "\n\nХотите продолжить?\n Да - 1 \n Нет - 0\n";
		cin >> check;
		
		while (check != 0 && check != 1)
		{//Проверка правильности введенных данных
			cout << "\nНеправильно введено значение!\n Нет - 0\n";
			cin >> check;
		}
		k = k++;
	}
	cout << "\n\nНажмите любую клавишу для продолжения..";
	_getch();
	CLS;
	
}
void lab3_1() {
	{
		int i, N;
		float a, k, X1, dX, X, Y, pod;
		cout << "\t\t\tАвтор сего произведения: Борлаков Амин. \nТема:Обработка одномерных массивов (типовая)\n\n\n" << endl;
		cout << "Построение таблицы значений алгебраической функции, зависящей от параметра ";
		cout << "и заданной на интервале конечной длины.\nГрафическая иллюстрация результатов." << endl;
		cout << "Формула: если x < 0, Y = 2*A*sqrt(|1-(x*x)/A*A)|), иначе Y = (A/(2*cos(x))) + (3*A)/2" << endl;
		cout << "\n\n\nВведите положительное значение параметра A = ";
		do
		{
			_getch;
			cin >> a;
			if (a <= 0)
			{
				cout << "Введено неверное значение параметра a" << "\n";
				cout << "Введите положительное значение параметра a ";
			}
		} while (a <= 0);
		cout << "Введите целое, положительное значение параметра N (кол-во точек), большее единицы: ";
		do
		{
			cin >> N;
			if (N <= 1)
			{
				cout << "Введено неверное значение параметра N" << "\n";
				cout << "Введите положительное целое значение параметра N, большее единицы: ";
			}
		} while (N <= 1);
		X1 = -1 * a;
		cout << "a = " << a << ", N = " << N << ", X1 = " << X1 << endl;
		do
		{
			cout << "Введите положительное значение параметра k, чтобы k*a было больше " << X1 / a << "\t";
			cin >> k;
			if (k * a < X1 / a)
			{
				cout << "Введено неверное значение параметра k" << "\n";
			}
		} while (k * a < X1 / a);
		CLS;
		dX = (3 * a) / 10;
		X = X1;
		i = 1;
		cout << "N" << setw(15) << "X" << setw(20) << "Y" << setw(1) << endl;
		for (pod = 1; pod < 50; pod++)
		{
			cout << ("_");
			if (pod == 49)
			{
				cout << endl;
			}
		}
		while (i <= N)
		{
			if (X < 0)
			{
				Y = 2 * a * sqrt(abs(1 - (X * X) / a * a));
			}
			else
			{
				Y = (a / (2 * cos(X)) + (3 * a) / 2);
			}
			cout << left << setw(15) << i;
			cout << left << setw(20) << floor(X * 1000 + 0.5) / 1000 << left << setw(25) << left << floor(Y * 1000 * 0.5) / 1000 << endl;
			X = X + dX;
			i = i + 1;
		}
		for (pod = 1; pod <50; pod++)
		{
			cout << ("_");
			if (pod == 49)
			{
				cout << endl;
			}
		}
	}
	RecData.model = mod_An_Y;
	stRect Rect(450, 380, 900, 400);
	DrawGraf(Rect, RecData, (char*)"График 1 семестра", (char*)"Ось X", (char*)"Ось Y", 2); DELAY; PAUSE;
	cout << "\n\nНажмите любую клавишу для продолжения..";
	_getch();
	CLS;
}

void lab3_2() {
	srand(time(NULL));
	cout << "Выполнил студент группы 1бИТС2 Борлаков Амин. \nТема: Обработка одномерных массивов с ветвлением алгоритма" << endl;
	cout << "\n\n\nДаны массивы R1...R7,d1...d7, и число N. Построить новый массив S по формуле:\n S = (R[i]/P) * d[j](7 раз), где:\n P = N - d[i], если 1 < d[i] < 2;\n P = 1/N, это в противном случае\n";

	double R[7], d[7], S[7], N, minD = 0.0, maxD = 10.0, P = 0, Pm = 1;

	cout << "\n\n\nВведите целочисленное значение переменной N: ";
	cin >> N;

	if (N == 0) {
		cout << "Ошибка! Значение не может быть равно 0";
		exit(1);
	}

	for (int i = 0; i < 7; i++) {
		cout << "Введите " << i + 1 << " элемент массива R: ";
		cin >> R[i];
		cout << " ";
	}

	cout << endl;

	for (int i = 0; i < 7; i++) {
		cout << "Введите " << i + 1 << " элемент массива d: ";
		cin >> d[i];
		cout << " ";
	}

	CLS;
	cout << "Ответ: " << endl;

	cout << "Массив R:" << endl;
	for (int i = 0; i < 7; i++) {
		R[i] = minD + R[i] * (maxD - minD);
		d[i] = minD + d[i] * (maxD - minD);
		Pm = d[i];

		if (d[i] > 1 && d[i] < 2) { // условие для P
			if (N == d[i]) { // проверка на 0
				cout << "Ошибка!";
				exit(1);
			}
			P += N - d[i];
		}
		else {
			P += 1 / N;
		}
		
		cout << setprecision(3) << R[i] << "\t"; // вывод 1го массива
		cout << d[i] << endl;
	}

	cout << endl;

	cout << "Массив S " << endl;
	for (int i = 0; i < 7; i++) { // массив S по условию
		S[i] = (R[i] / P) * Pm;
		cout << fixed << S[i] << "\t";
		cout << endl;
	}

	cout << "\n\nНажмите любую клавишу для продолжения..";
	_getch();
	CLS;
}

void lab4()
{
	// Инициализация генератора случайных чисел
	srand(time(NULL));

	// Вывод информации о студенте и теме лабораторной работы
	cout << "Выполнил студент группы 1бИТС2 Борлаков Амин. Тема: Обработка матриц" << endl;
	cout << "\n\n\nВ положительной целочисленной матрице имеется несколько столбцов, только из единиц.\n Заменить элементы этих столбцов полусуммой элементов всех остальных столбцов.\n";

	const int y0 = 4, x0 = 4;
	int arr[x0][y0], Y, sum = 0;

	// Ввод значения Y
	do {
		cout << "\n\n\nВведите значение переменной Y для задания размерности матрицы (0 <= Y < " << y0 << "): ";
		cin >> Y;
	} while (Y < 0 || Y >= y0);
	CLS;
	// Заполнение массива случайными значениями или ввод с клавиатуры
	for (int i = 0; i < x0; i++)
	{
		for (int j = 0; j < y0; j++) {
			//arr[i][j] = rand() % 10; // Раскомментируйте, если нужно заполнить случайными значениями
			cout << "Введите элемент массива R[" << i << "][" << j << "]: ";
			cin >> arr[i][j];
		}
	}

	// Замена элементов массива с индексом столбца Y на 1 и подсчет суммы остальных элементов
	cout << "Вышла матрица: " << endl;
	for (int i = 0; i < x0; i++)
	{
		for (int j = 0; j < y0; j++) {
			if (j == Y)
			{
				arr[i][j] = 1;
			}
			else
				sum += arr[i][j];
			cout << setw(4) << arr[i][j] << " ";
		}
		cout << endl;
	}
	cout << endl << "Сумма элементов массива, не входящих в столбец Y: " << sum << endl;

	// Замена элементов массива с индексом столбца Y на сумму остальных элементов
	for (int i = 0; i < x0; i++)
	{
		for (int j = 0; j < y0; j++)
		{
			if (j == Y)
			{
				arr[i][j] = sum;
			}
			cout << setw(4) << arr[i][j] << " ";
		}
		cout << endl;
	}
	CLS;


}

